Tekla.Structures.ModelInternal.GeometryNode
The GeometryNode class represents geometry tree node. This is base class for other geometry nodes and can't be used directly

Tekla.Structures.ModelInternal.GeometryNode.AddChild(Tekla.Structures.ModelInternal.GeometryNode)
Add child to the geometry cylindrical surface geometry tree.
child: The child to be added.

Tekla.Structures.ModelInternal.GeometryNode.Children
The children of the node.